def memory_example():
    # Создание списка чисел и сохранение его в памяти
    numbers = [1, 2, 3, 4, 5]
    
    # Вывод списка на экран
    print("Numbers:", numbers)

# Вызов функции для демонстрации работы с памятью
memory_example()

def memory_example_1():
    # Создание списка чисел с использованием генератора списков и сохранение его в памяти
    numbers_1 = [i for i in range(1, 6)]
    
    # Вывод списка на экран
    print("Numbers:", numbers_1)

# Вызов функции для демонстрации работы с памятью
memory_example_1()
